---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarNoMatchingHooks
source: html/6660bc1b-a6fb-97f5-f16b-4515e5245abb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarNoMatchingHooks Property

The Rebar Shape '[Family Name]' has no matching hooks.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarNoMatchingHooks { get; }
```